### In-game stats ###

# English
en = """<p><code>Generated using <a href="https://t.me/csgobetabot">@csgobetabot</a> ❤️</code></p>
<h3>📊 General in-game statistics:</h3>
<ul><li>Playtime (matchmaking): <b>{:,}</b>h</li><li>Kills: <b>{:,}</b></li><li>Deaths: <b>{:,}</b></li><li>K/D ratio: <b>{}</b></li></ul><br>
<ul><li>Matches played: <b>{:,}</b></li><li>Matches won: <b>{:,}</b></li><li>Win percentage: <b>{}</b>%</li><li>Rounds played: <b>{:,}</b></li><li>Pistol rounds won: <b>{:,}</b></li></ul>
<hr>
<h3>🔫 Shooting statistics:</h3>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li><li>Headshot accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🗺️ Map statistics:</h3>
<ul><li>Best map: <b>{}</b></li><li>Win percentage: <b>{}</b>%</li></ul>
<hr>
<h3>🔰 Misc:</h3>
<ul><li>MVPs: <b>{:,}</b></li><li>Money earned: <b>{:,}</b>$</li><li>Hostages rescued: <b>{:,}</b></li><li>Weapons donated: <b>{:,}</b></li><li>Windows broken: <b>{:,}</b></li></ul><br>
<ul><li>Damage done: <b>{:,}</b></li><li>Bombs planted: <b>{:,}</b></li><li>Bombs defused: <b>{:,}</b></li></ul><br>
<ul><li>Knife kills: <b>{:,}</b></li><li>HE grenade kills: <b>{:,}</b></li><li>Molotov kills: <b>{:,}</b></li></ul><br>
<ul><li>Zeus shots: <b>{:,}</b></li><li>Zeus kills: <b>{:,}</b></li><li>Zeus fire accuracy: <b>{}</b>%</li></ul><br>
<ul><li>Knife fights won: <b>{:,}</b></li><li>Kills with enemy weapons: <b>{:,}</b></li><li>Blind enemies killed: <b>{:,}</b></li><li>Zoomed snipers killed: <b>{:,}</b></li></ul>
<hr>
<h3>🔫 Gun statistics:</h3>
<h4>AK-47:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>M4A4 / M4A1-S:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>AWP:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Pistol statistics:</h3>
<h4>Glock-18:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>USP-S / P2000:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>P250:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Dual Berettas:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Five-SeveN / CZ75-Auto:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Tec-9 / CZ75-Auto:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Desert Eagle / R8 Revolver:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 SMG statistics:</h3>
<h4>MAC-10:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>MP7 / MP5-SD:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>MP9:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>UMP-45:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>PP-Bizon:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>P90:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Rifle statistics:</h3>
<h4>Famas:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Galil AR:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>AUG:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>SG 553:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Sniper rifle statistics:</h3>
<h4>SSG 08:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>SCAR-20:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>G3SG1:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Heavy gun statistics:</h3>
<h4>Nova:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>MAG-7:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Sawed-Off:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>XM1014:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Negev:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>M249:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>"""


# Russian
ru = """<p><code>Cгенерировано с помощью <a href="https://t.me/csgobetabot">@csgobetabot</a> ❤️</code></p>
<h3>📊 Общая игровая статистика:</h3>
<ul><li>Время в игре (матчмейкинг): <b>{:,}</b> ч.</li><li>Убийств: <b>{:,}</b></li><li>Смертей: <b>{:,}</b></li><li>Соотношение У/С: <b>{}</b></li></ul>
<ul><li>Матчей сыграно: <b>{:,}</b></li><li>Матчей выиграно: <b>{:,}</b></li><li>Процент побед: <b>{}</b>%</li><li>Раундов сыграно: <b>{:,}</b></li><li>Пистолетных раундов выиграно: <b>{:,}</b></li></ul>
<hr>
<h3>🔫 Статистика стрельбы:</h3>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li><li>Процент попаданий в голову: <b>{}</b>%</li></ul>
<hr>
<h3>🗺️ Статистика карт:</h3>
<ul><li>Лучшая карта: <b>{}</b></li><li>Процент побед: <b>{}</b>%</li></ul>
<hr>
<h3>🔰 Прочее:</h3>
<ul><li>Наград СЦИ: <b>{:,}</b></li><li>Денег заработано: <b>{:,}</b>$</li><li>Заложников спасено: <b>{:,}</b></li><li>Оружий выброшено: <b>{:,}</b></li><li>Разбито окон: <b>{:,}</b></li></ul><br>
<ul><li>Нанесено урона: <b>{:,}</b></li><li>Бомб установлено: <b>{:,}</b></li><li>Бомб обезврежено: <b>{:,}</b></li></ul><br>
<ul><li>Убийств ножом: <b>{:,}</b></li><li>Убийств гранатой: <b>{:,}</b></li><li>Убийств «коктейлем Молотова»: <b>{:,}</b></li></ul><br>
<ul><li>Выстрелов из Zeus: <b>{:,}</b></li><li>Убийств из Zeus: <b>{:,}</b></li><li>Точность попаданий из Zeus: <b>{}</b>%</li></ul><br>
<ul><li>Выиграно поедников на ножах: <b>{:,}</b></li><li>Убийств из вражеского оружия: <b>{:,}</b></li><li>Ослепленных врагов убито: <b>{:,}</b></li><li>Убито прицелившихся снайперов: <b>{:,}</b></li></ul>
<hr>
<h3>🔫 Статистика оружий:</h3>
<h4>AK-47:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>M4A4 / M4A1-S:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>AWP:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика пистолетов:</h3>
<h4>Glock-18:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>USP-S / P2000:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>P250:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Dual Berettas:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Five-SeveN / CZ75-Auto:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Tec-9 / CZ75-Auto:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Desert Eagle / R8 Revolver:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика пистолетов-пулемётов:</h3>
<h4>MAC-10:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>MP7 / MP5-SD:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>MP9:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>UMP-45:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>PP-Bizon:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>P90:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика винтовок:</h3>
<h4>Famas:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Galil AR:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>AUG:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>SG 553:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика снайперских винтовок:</h3>
<h4>SSG 08:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>SCAR-20:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>G3SG1:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика тяжёлых оружий:</h3>
<h4>Nova:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>MAG-7:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Sawed-off:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>XM1014:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Negev:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>M249:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>"""
